In [1]:
import pandas as pd

In [2]:
# how to open csv file in pandas
df = pd.read_csv("house.csv")

In [3]:
#give background of data set
df.head()

   number_of_rooms  floor  area   latitude  longitude   price
0                1      1  58.0  38.585834  68.793715  330000
1                1     14  68.0  38.522254  68.749918  340000
2                3      8  50.0        NaN        NaN  700000
3                3     14  84.0  38.520835  68.747908  700000
4                3      3  83.0  38.564374  68.739419  415000

In [4]:
#take is the handle the null values
df.isnull().sum()

number_of_rooms       0
floor                 0
area                  0
latitude           1849
longitude          1849
price                 0
dtype: int64

In [5]:
#total length of data set
len(df)

5579

In [6]:
df1 = df.copy()

In [7]:
df1.head()

   number_of_rooms  floor  area   latitude  longitude   price
0                1      1  58.0  38.585834  68.793715  330000
1                1     14  68.0  38.522254  68.749918  340000
2                3      8  50.0        NaN        NaN  700000
3                3     14  84.0  38.520835  68.747908  700000
4                3      3  83.0  38.564374  68.739419  415000

In [8]:
#drop method
df1.dropna(inplace=True)

In [9]:
df1.head()

   number_of_rooms  floor  area   latitude  longitude   price
0                1      1  58.0  38.585834  68.793715  330000
1                1     14  68.0  38.522254  68.749918  340000
3                3     14  84.0  38.520835  68.747908  700000
4                3      3  83.0  38.564374  68.739419  415000
5                3      4  53.0  38.530686  68.745261  513000

In [10]:
df1.isnull().sum()

number_of_rooms    0
floor              0
area               0
latitude           0
longitude          0
price              0
dtype: int64

In [11]:
#ffill
df2 = df.copy()

In [12]:
df2.ffill(inplace=True)

In [13]:
df2.head()

   number_of_rooms  floor  area   latitude  longitude   price
0                1      1  58.0  38.585834  68.793715  330000
1                1     14  68.0  38.522254  68.749918  340000
2                3      8  50.0  38.522254  68.749918  700000
3                3     14  84.0  38.520835  68.747908  700000
4                3      3  83.0  38.564374  68.739419  415000

In [14]:
df2.isnull().sum()

number_of_rooms    0
floor              0
area               0
latitude           0
longitude          0
price              0
dtype: int64

In [15]:
#bfill-this fills backward
df3= df.copy()

In [16]:
df3.bfill(inplace=True)

In [17]:
df3.head()

   number_of_rooms  floor  area   latitude  longitude   price
0                1      1  58.0  38.585834  68.793715  330000
1                1     14  68.0  38.522254  68.749918  340000
2                3      8  50.0  38.520835  68.747908  700000
3                3     14  84.0  38.520835  68.747908  700000
4                3      3  83.0  38.564374  68.739419  415000

In [19]:
df3.isnull().sum()

number_of_rooms    0
floor              0
area               0
latitude           6
longitude          6
price              0
dtype: int64

In [20]:
#no values is behind it so couldnt fill
df3.tail()

      number_of_rooms  floor   area  latitude  longitude    price
5574                4     16  125.0       NaN        NaN   600000
5575                2     17   71.0       NaN        NaN   489900
5576                1      9   51.0       NaN        NaN   361220
5577                6      6  200.0       NaN        NaN  1500000
5578                1     10   44.0       NaN        NaN   304650

In [21]:
#fillna
df4 = df.copy()

In [22]:
df4.fillna(df4.mean())

      number_of_rooms  floor   area   latitude  longitude    price
0                   1      1   58.0  38.585834  68.793715   330000
1                   1     14   68.0  38.522254  68.749918   340000
2                   3      8   50.0  38.553452  68.768399   700000
3                   3     14   84.0  38.520835  68.747908   700000
4                   3      3   83.0  38.564374  68.739419   415000
...               ...    ...    ...        ...        ...      ...
5574                4     16  125.0  38.553452  68.768399   600000
5575                2     17   71.0  38.553452  68.768399   489900
5576                1      9   51.0  38.553452  68.768399   361220
5577                6      6  200.0  38.553452  68.768399  1500000
5578                1     10   44.0  38.553452  68.768399   304650

[5579 rows x 6 columns]

In [ ]:
df4